# Viewing Data in Pandas

**Importing modules**

In [1]:
import pandas as pd
import numpy as np

**Creating DataFrame**

In [2]:
df = pd.read_csv('Data/nba.csv')
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Column names

In [3]:
df.columns
# df.columns.values
# df.columns.values.tolist()
# df.keys()

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

## Top rows of the DataFrame

In [4]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [5]:
# view top n data
df.head(n=10)
# df.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

**Selecting series**

In [6]:
df['Name'].head()

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [7]:
df[['Name', 'Team', 'Position']].head()

            Name            Team Position
0  Avery Bradley  Boston Celtics       PG
1    Jae Crowder  Boston Celtics       SF
2   John Holland  Boston Celtics       SG
3    R.J. Hunter  Boston Celtics       SG
4  Jonas Jerebko  Boston Celtics       PF

## Bottom rows of the DataFrame

In [8]:
df.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
# view bottom n data
df.tail(n=10)
# df.tail(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
448,Gordon Hayward,Utah Jazz,20.0,SF,26.0,6-8,226.0,Butler,15409570.0
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0
450,Joe Ingles,Utah Jazz,2.0,SF,28.0,6-8,226.0,NaN,2050000.0
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

**Selecting series**

In [10]:
df['Name'].tail()

453    Shelvin Mack
454       Raul Neto
455    Tibor Pleiss
456     Jeff Withey
457             NaN
Name: Name, dtype: object

In [11]:
df[['Name', 'Team', 'Position']].tail()

             Name       Team Position
453  Shelvin Mack  Utah Jazz       PG
454     Raul Neto  Utah Jazz       PG
455  Tibor Pleiss  Utah Jazz        C
456   Jeff Withey  Utah Jazz        C
457           NaN        NaN      NaN

## Basic statistical details

In [12]:
df.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [13]:
df.describe(percentiles=[.20, .40, .60, .80])

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
20%      4.000000   23.000000  195.600000  9.472760e+05
40%     10.000000   25.000000  213.400000  1.938840e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
60%     18.600000   27.000000  230.000000  3.815000e+06
80%     30.000000   30.000000  245.000000  8.042895e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [14]:
df.describe(include=['object', 'float', 'int'])

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
count,457,457,457.000000,457,457.000000,457,457.000000,373,4.460000e+02
unique,457,30,NaN,5,NaN,18,NaN,118,NaN
top,Avery Bradley,New Orleans Pelicans,NaN,SG,NaN,6-9,NaN,Kentucky,NaN
freq,1,19,NaN,102,NaN,59,NaN,22,NaN
mean,NaN,NaN,17.678337,NaN,26.938731,NaN,221.522976,NaN,4.842684e+06
std,NaN,NaN,15.966090,NaN,4.404016,NaN,26.368343,NaN,5.229238e+06
min,NaN,NaN,0.000000,NaN,19.000000,NaN,161.000000,NaN,3.088800e+04
25%,NaN,NaN,5.000000,NaN,24.000000,NaN,200.000000,NaN,1.044792e+06
50%,NaN,NaN,13.000000,NaN,26.000000,NaN,220.000000,NaN,2.839073e+06
75%,NaN,NaN,25.000000,NaN,30.000000,NaN,240.000000,NaN,6.500000e+06
max,NaN,NaN,99.000000,NaN,40.000000,NaN,307.000000,NaN,2.500000e+07

**Describing details of series with different data types**

In [15]:
df['Name'].describe()
# Column: Name dtype: object

count               457
unique              457
top       Avery Bradley
freq                  1
Name: Name, dtype: object

In [16]:
df['Age'].describe()

count    457.000000
mean      26.938731
std        4.404016
min       19.000000
25%       24.000000
50%       26.000000
75%       30.000000
max       40.000000
Name: Age, dtype: float64

In [17]:
df['Position'].describe()

count     457
unique      5
top        SG
freq      102
Name: Position, dtype: object

## Pandas DataFrame to numpy array

In [18]:
arr = df.to_numpy()
arr, type(arr), arr.dtype, arr.ndim, arr.shape

(array([['Avery Bradley', 'Boston Celtics', 0.0, ..., 180.0, 'Texas',
         7730337.0],
        ['Jae Crowder', 'Boston Celtics', 99.0, ..., 235.0, 'Marquette',
         6796117.0],
        ['John Holland', 'Boston Celtics', 30.0, ..., 205.0,
         'Boston University', nan],
        ...,
        ['Tibor Pleiss', 'Utah Jazz', 21.0, ..., 256.0, nan, 2900000.0],
        ['Jeff Withey', 'Utah Jazz', 24.0, ..., 231.0, 'Kansas', 947276.0],
        [nan, nan, nan, ..., nan, nan, nan]], dtype=object),
 numpy.ndarray,
 dtype('O'),
 2,
 (458, 9))

**Converting particular column**

In [19]:
arr = df['Age'].to_numpy()
arr, type(arr), arr.dtype, arr.ndim, arr.shape

(array([25., 25., 27., 22., 29., 29., 21., 25., 22., 22., 24., 27., 27.,
        20., 26., 27., 24., 28., 21., 32., 22., 26., 23., 28., 21., 26.,
        25., 26., 28., 27., 30., 33., 23., 32., 34., 25., 24., 23., 28.,
        26., 20., 26., 28., 32., 25., 23., 37., 25., 25., 22., 22., 22.,
        32., 24., 24., 22., 20., 27., 22., 25., 20., 23., 20., 29., 26.,
        29., 24., 30., 23., 27., 23., 25., 36., 29., 24., 24., 33., 24.,
        31., 25., 28., 26., 26., 32., 30., 20., 23., 30., 28., 26., 33.,
        27., 29., 36., 23., 29., 27., 28., 27., 29., 31., 38., 39., 31.,
        23., 25., 31., 24., 23., 37., 24., 29., 33., 25., 23., 21., 20.,
        27., 29., 36., 31., 26., 19., 28., 33., 21., 25., 24., 22., 27.,
        25., 32., 30., 31., 22., 23., 25., 27., 30., 36., 27., 22., 28.,
        25., 25., 24., 29., 27., 23., 24., 30., 25., 31., 26., 35., 23.,
        35., 30., 27., 24., 25., 27., 31., 21., 27., 24., 25., 33., 24.,
        31., 35., 35., 35., 31., 27., 25., 29., 25., 30., 25., 33., 33.,
        29., 36., 25., 25., 23., 23., 22., 23., 23., 26., 20., 28., 26.,
        31., 27., 24., 30., 26., 30., 28., 25., 28., 29., 29., 22., 30.,
        20., 25., 23., 21., 27., 24., 25., 21., 25., 21., 28., 24., 26.,
        32., 23., 21., 27., 29., 19., 22., 31., 28., 31., 33., 33., 29.,
        28., 29., 37., 32., 27., 24., 31., 31., 30., 27., 27., 30., 22.,
        22., 27., 26., 22., 30., 24., 23., 25., 30., 38., 21., 34., 37.,
        36., 39., 28., 23., 29., 31., 25., 23., 22., 24., 24., 34., 25.,
        28., 28., 28., 28., 29., 26., 27., 29., 23., 23., 30., 25., 26.,
        25., 29., 27., 25., 25., 27., 31., 28., 30., 22., 36., 34., 40.,
        38., 28., 24., 27., 33., 40., 27., 34., 26., 35., 26., 24., 35.,
        30., 31., 35., 31., 24., 24., 22., 27., 32., 31., 24., 27., 27.,
        24., 27., 30., 21., 28., 31., 23., 22., 24., 30., 27., 26., 29.,
        23., 32., 31., 30., 30., 36., 34., 24., 29., 22., 33., 34., 23.,
        26., 20., 30., 26., 23., 20., 21., 29., 26., 23., 24., 26., 24.,
        22., 30., 25., 32., 33., 22., 30., 24., 34., 32., 27., 33., 26.,
        20., 23., 30., 30., 29., 25., 28., 28., 25., 29., 26., 27., 21.,
        21., 24., 36., 20., 34., 21., 23., 23., 28., 26., 40., 20., 21.,
        23., 25., 30., 36., 25., 29., 25., 20., 21., 22., 35., 27., 32.,
        24., 26., 24., 24., 38., 30., 21., 24., 28., 24., 27., 20., 25.,
        23., 24., 27., 23., 28., 34., 24., 25., 24., 23., 26., 30., 20.,
        28., 23., 24., 20., 24., 23., 26., 23., 28., 26., 20., 26., 24.,
        26., 26., nan]),
 numpy.ndarray,
 dtype('float64'),
 1,
 (458,))

## Pandas Series to numpy array

In [20]:
series = pd.Series(df['Number'].dropna(inplace=False))
# Dropping the NaN values. Otherwise, it gives RuntimeWarning while converting datatype to int64.
arr = series.to_numpy(dtype='int64')
type(series), arr, type(arr), arr.ndim, arr.shape

(pandas.core.series.Series,
 array([ 0, 99, 30, 28,  8, 90, 55, 41, 12, 36,  7,  4, 11, 13, 44, 44, 22,
        21, 24,  2, 10,  6,  0, 11,  1, 33, 41, 14, 15, 30,  4, 17, 43,  7,
         3, 11,  2, 13,  8,  9,  6,  1, 42, 18, 23,  5, 42,  0, 33, 21, 39,
        22,  7,  5, 12,  4,  8,  1, 11, 31, 35,  8, 20,  5, 10,  3,  6,  7,
        92, 54, 24, 31,  4,  1, 17, 55, 19, 40, 12, 21, 30, 31, 23,  9, 34,
        36, 20,  4,  5, 11, 18, 45, 19, 11, 22,  8, 32, 33,  6, 12,  3, 34,
         9,  4, 25, 30,  2, 28,  3, 24,  6, 17,  9,  4,  7, 30,  1, 50, 23,
        37,  0,  2,  1, 10,  4, 20, 23,  3, 21, 30, 25, 14, 35, 17, 12, 15,
        13,  5,  3, 31, 18,  0,  7, 15, 30, 26,  8, 41, 23, 25,  9, 41,  0,
        21, 34,  6, 16, 22,  7,  3, 44, 55, 13,  5,  1, 20,  8,  9,  2, 23,
        24, 30,  1, 14,  0, 12, 20,  4,  5, 13, 52, 50, 12, 22, 17, 25,  5,
         8,  0, 34,  6,  1,  3, 20, 13, 43,  5, 25, 11, 13,  3, 27, 44, 10,
        28,  0, 40,  2, 33, 42,  1, 34, 19,  5,  9, 11, 31, 17,  3, 22, 15,
         6, 77, 12, 18, 21, 20,  1,  5, 21,  2, 34, 42, 23, 11, 50, 41, 27,
        25,  7,  3,  8,  1,  8,  2, 33, 15,  7,  0, 13, 35, 12,  6, 32, 20,
         5, 31,  3,  9,  7, 22, 15, 11,  8,  4, 33,  0, 19, 10,  5, 14, 50,
         1, 35, 34, 42, 33,  3,  8, 30, 44, 23, 31, 16,  4,  1,  2, 15, 10,
        25, 11,  0,  5, 20, 12,  1, 15, 33, 21, 20, 14,  2, 40, 23, 24,  8,
         9, 17, 30, 24, 10, 12, 15, 43, 26,  4, 31, 13, 17, 32, 25, 11, 22,
         0,  5, 30, 12, 50,  9,  0, 25, 44, 14,  3,  1,  7, 15,  2, 40,  1,
         9,  7, 14, 40,  2,  8,  4,  0,  5,  3, 12, 21, 20, 11,  3, 10,  0,
        23,  7, 55, 11, 13, 44,  5,  4, 14,  9, 32,  6,  3,  1,  8, 90, 13,
        21, 42,  5, 12, 22,  7, 17, 15,  2,  0, 12,  5, 21, 35,  8, 14, 15,
        77,  3,  0,  1, 23,  9,  6, 88,  5, 21,  1,  8, 15, 33, 14, 12,  9,
        10,  4, 32, 22, 12,  4, 35,  6, 34,  9, 11, 33, 13,  2, 22, 21,  5,
         3,  0, 34,  8,  5, 23, 17,  4,  9, 35, 11,  0,  3, 44, 24,  2, 21,
        33,  3, 10, 11, 15, 27, 20,  5,  2, 23, 41,  8, 25, 21, 24]),
 numpy.ndarray,
 1,
 (457,))

## Finding missing values

In [21]:
df.isnull()

      Name   Team  Number  Position    Age  Height  Weight  College  Salary
0    False  False   False     False  False   False   False    False   False
1    False  False   False     False  False   False   False    False   False
2    False  False   False     False  False   False   False    False    True
3    False  False   False     False  False   False   False    False   False
4    False  False   False     False  False   False   False     True   False
..     ...    ...     ...       ...    ...     ...     ...      ...     ...
453  False  False   False     False  False   False   False    False   False
454  False  False   False     False  False   False   False     True   False
455  False  False   False     False  False   False   False     True   False
456  False  False   False     False  False   False   False    False   False
457   True   True    True      True   True    True    True     True    True

[458 rows x 9 columns]

In [22]:
df.isnull().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [23]:
df.notnull().head()

   Name  Team  Number  Position   Age  Height  Weight  College  Salary
0  True  True    True      True  True    True    True     True    True
1  True  True    True      True  True    True    True     True    True
2  True  True    True      True  True    True    True     True   False
3  True  True    True      True  True    True    True     True    True
4  True  True    True      True  True    True    True    False    True

In [24]:
df.notnull().sum()

Name        457
Team        457
Number      457
Position    457
Age         457
Height      457
Weight      457
College     373
Salary      446
dtype: int64